Repository: fatehullah778866/python-flask-full-guide
Catalog: mini-projects/27-multi-language-support/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr

source: Multi-language Support
de: Mehrsprachige Unterstützung
es: Soporte Multiidioma
fr: Support Multi-langues

source: Welcome
de: Willkommen
es: Bienvenido
fr: Bienvenue

source: This is a multi-language application. You can switch between different languages using the selector above.
de: Dies ist eine mehrsprachige Anwendung. Sie können zwischen verschiedenen Sprachen mit dem obigen Auswahlfeld wechseln.
es: Esta es una aplicación multiidioma. Puede cambiar entre diferentes idiomas usando el selector de arriba.
fr: Ceci est une application multi-langues. Vous pouvez basculer entre différentes langues en utilisant le sélecteur ci-dessus.

source: Features
de: Funktionen
es: Características
fr: Fonctionnalités

source: Support for multiple languages
de: Unterstützung für mehrere Sprachen
es: Soporte para múltiples idiomas
fr: Support pour plusieurs langues

source: Easy language switching
de: Einfacher Sprachwechsel
es: Cambio de idioma fácil
fr: Changement de langue facile

source: Automatic date/time formatting
de: Automatische Datums-/Zeitformatierung
es: Formato automático de fecha/hora
fr: Formatage automatique de la date/heure

source: Browser language detection
de: Browser-Spracherkennung
es: Detección de idioma del navegador
fr: Détection de la langue du navigateur

source: Current Date and Time
de: Aktuelles Datum und Uhrzeit
es: Fecha y Hora Actual
fr: Date et Heure Actuelles

source: Date:
de: Datum:
es: Fecha:

source: Time:
de: Zeit:
es: Hora:
fr: Heure:

source: How to Use
de: So verwenden Sie
es: Cómo Usar
fr: Comment Utiliser

source: Select a language from the dropdown menu above
de: Wählen Sie eine Sprache aus dem Dropdown-Menü oben aus
es: Seleccione un idioma del menú desplegable de arriba
fr: Sélectionnez une langue dans le menu déroulant ci-dessus

source: The page content will update automatically
de: Der Seiteninhalt wird automatisch aktualisiert
es: El contenido de la página se actualizará automáticamente
fr: Le contenu de la page sera mis à jour automatiquement

source: Date and time will be formatted according to the selected language
de: Datum und Uhrzeit werden entsprechend der ausgewählten Sprache formatiert
es: La fecha y hora se formatearán según el idioma seleccionado
fr: La date et l'heure seront formatées selon la langue sélectionnée

source: Your language preference will be saved in the session
de: Ihre Sprachpräferenz wird in der Sitzung gespeichert
es: Su preferencia de idioma se guardará en la sesión
fr: Votre préférence de langue sera enregistrée dans la session
